Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: གཉིས་པར་ཕྱོགས་སུ་རྣམ་པར་འཁྱམ། །
en: In the second, they wander throughout the country,

source: ཞག་བདུན་གསུམ་པར་རྣམ་པར་འཇིག །
en: In the third, they perish—

source: དེ་བས་ལས་འདི་བྱ་བ་མིན། །
en: One should not perform such rites. {27.69}

source: སེམས་ཅན་གདུལ་བྱའི་དོན་ཉིད་ལ། །འཇིག་རྟེན་འདྲེན་པས་བསྟན་པ་ཡིན། །
en: “These rites have been designated by the guides of the world To be solely for the purpose of guiding beings,

source: སངས་རྒྱས་ཐུགས་ནི་དག་པ་ཡིས། །གདུག་པའི་ལས་འདི་གསུང་མི་འགྱུར། །
en: Because the buddhas, having pure minds, Do not resort to violent means. {27.70}

source: སྲོག་ལ་གནོད་པར་བྱེད་པའི་ལས། །སངས་རྒྱས་ཀུན་གྱིས་སྨད་པ་ཡིན། །
en: “All the buddhas abhor The rites that obstruct the life force;

source: གྲུབ་པ་མཆོག་ནི་རབ་འདོད་པའི། །ཟློས་པ་དེ་དག་བྱ་བ་མིན། །
en: No reciter should do such rites, If he desires supreme accomplishment. {27.71}

source: དམྱལ་བ་དག་ཏུ་སྐྱེ་བའི་ལས། །འདི་དག་ཉིད་ལ་རབ་ཏུ་སྣང་། །
en: “One indulging in such wantonness Will only see one’s own fall into hell.

source: དཀར་ནག་འབྲས་བུར་འབྱུང་བྱེད་པ། །འདི་དག་ཁོ་ན་བསྟན་པ་ཡིན། །
en: This has been described as the ripening Of one’s solely black karma (the result of solely black rites). {27.72}

source: ལས་རྣམས་སྣ་ཚོགས་བདག་ཉིད་ཆེ། །རྐང་གཉིས་མཆོག་གིས་ཇི་བཞིན་གཟིགས། །རྟག་ཏུ་དཀར་ལས་དཀར་བ་བྱུང་། །
en: “As observed by the most eminent among two-legged beings, The diversity and efficacy of rites (karma) Always makes the arising of virtue possible;

source: ནག་ལས་ནག་པ་རབ་ཏུ་སྨིན། །
en: Black rites of the [practitioner] can still produce virtuous results. {27.73}

source: འདྲེས་ལས་འདྲེས་པའི་ལས་རྣམས་ནི། །འདྲེས་པ་དག་ཏུ་རྣམ་པར་སྨིན། །
en: “Accordingly, the karma is mixed And is taught as such.

source: དེ་བཞིན་ལས་འདི་སྣ་ཚོགས་སུ། །དེ་ཉིད་སངས་རྒྱས་གཟིགས་པ་ཡི། །ཐུགས་རྗེ་ཅན་གྱིས་གསུངས་པའོ། །
en: This is why such a variety of rites Have been taught by those who know reality. {27.74}

source: དེ་ལས་ཟློས་པ་སྤང་བྱ་བ། །ནག་དང་འདྲེས་པའི་ལས་ཉིད་དོ། །
en: “The reciter should avoid Black or mixed rites (karma),

source: དགེ་བྱེད་དཀར་པོ་བསྟེན་པར་བྱ། །
en: But rely on the auspicious white ones,

source: དགེ་བའི་ལས་ཀྱི་འབྲས་བུ་འབྱུང་། །
en: Which will bring the karmic results of good karma (activities). {27.75}

source: སྲོག་གཅོད་པས་ནི་ཟློས་པ་དག །
en: “Through destroying life,

source: ཡང་དང་ཡང་དུ་དམྱལ་བར་འགྲོ། །
en: The reciter will end up in hell again and again.

source: དེ་བཞིན་དེ་ལས་ལོག་པའི་ཆོས། །འཚེ་མེད་ལས་ནི་དམ་པ་ཡིན། །
en: Desisting from it, which is the practice of ahiṃsā, Is the supreme activity (karma). {27.76}

source: དགེ་བའི་བློས་ནི་སྔགས་རྣམས་དང་། །དེ་བཞིན་མཐོ་རིས་ཐར་པ་འགྲུབ། །
en: “Mastering the mantras Leads to paradise and happy rebirths,

source: ལེགས་བྱས་ལས་ཀྱིས་ཐོབ་པ་ཡིན། །
en: Which are obtained through skillful rites (meritorious karma)

source: འགལ་བའི་ལས་ཀྱིས་འགལ་བར་གསུངས། །
en: And blocked by the rites (karma) that are (is) their (its) opposite. {27.77}

source: ཇི་ལྟར་ཆོས་དང་ཆོས་མིན་གསུངས། །
en: “I have explained Dharma and non-Dharma,

source: ཐམས་ཅད་མཁྱེན་ཉིད་སྤྱོད་པ་ཡིན། །
en: Differentiated ( viceṣṭita ) based on omniscient knowledge.

source: ཟློས་པ་གྲུབ་པར་འདོད་པ་ཡིས། །དགེ་བའི་ལས་ནི་བརྩམ་པར་བྱ། །
en: If the reciter desires accomplishment, He should always perform virtuous rites (create good karma). {27.78}

source: ཟློས་པ་དགེ་ལ་གནས་པ་ལ། །དེ་ཡི་སྔགས་ནི་འགྲུབ་པར་འགྱུར། །
en: “When virtue is present, The mantras of the practitioner will be successful.

source: དཀར་པོའི་ལས་ལ་གཞོལ་བྱེད་ལ། །དེ་ཡི་ཐར་པ་མི་ལྡོག་འགྱུར། །
en: If he is dedicated to white rites (to accumulating good karma), His liberation is guaranteed. {27.79}

source: སྔགས་ཀྱིས་དགེ་བ་འགྲུབ་འགྱུར་ཞེས། །དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་གསུངས། །
en: “The tathāgatas proclaim that, for a mantra practitioner, Accomplishment is obtained through virtue.

source: ལས་རྣམས་སྣ་ཚོགས་གསུངས་པ་ནི། །སྒྲུབ་པ་རྣམས་ལ་བསྡུས་དོན་ཡིན། །
en: For guiding ordinary beings, though, They teach different types of rites. {27.80}

source: ཅི་འདོད་ལས་ནི་སྟོང་ཕྲག་བརྒྱད། །ཕྲ་མོའི་ལས་ནི་བྱེད་པ་ན། །
en: “One may accomplish, if one so desires, One thousand and eight rites.

source: སྒྲུབ་པ་པོ་ནི་མི་འགྲུབ་སྟེ། །གྲུབ་པ་མཆོག་ནི་མི་འཐོབ་བོ། །
en: Still, if one performs inferior rites, One will not obtain the highest accomplishment. {27.81}

source: འབད་པས་བཟླས་དང་སྦྱིན་སྲེག་བྱ། །གྲུབ་པ་འབྲིང་ནི་འགྲུབ་པར་འགྱུར། །
en: “By putting effort into the recitation and the homa, One will obtain a middling accomplishment.

source: ཆོ་ག་མཐོང་བའི་ལས་ཀྱི་ནི། །ཐ་མ་མྱུར་དུ་འགྲུབ་པར་འགྱུར། །
en: The inferior accomplishment will be won swiftly If the rite is [simply] performed according to procedure. {27.82}

source: མཆོག་དང་ཐ་མ་བར་མ་ཡི། །ལས་ནི་རྣམ་པ་གསུམ་དུ་བསྟན། །
en: “The rites (karma) have been taught To be of three types—supreme, middling, and inferior.

source: དཀའ་ཐུབ་ཅན་ནི་ཟློས་མཆོག་གིས། །དེ་བཞིན་གྲུབ་པ་མཆོག་ཐོབ་འགྱུར། །
en: A superior reciter who is an ascetic Will obtain the supreme. {27.83}

source: དེ་བཞིན་བཟླས་པ་བར་མ་ཡིས། །བར་མ་ལས་གྲུབ་ཐོབ་པ་ཡིན། །
en: “A middling reciter will obtain Success in the middling (will accumulate middling karma).

source: དེ་བཞིན་ཟློས་པ་ཐ་མས་ནི། །ཐ་མའི་ལས་ལ་ཡང་དག་བརྟེན། །
en: An inferior reciter will always Be limited to inferior rites (accumulating inferior karma). {27.84}

source: གྲུབ་པ་ཕྲ་མོ་ཐོབ་པར་ཡང་། །གཞན་གྱི་གྲུབ་པ་ཐོབ་མ་ཡིན། །
en: “He will win an inferior accomplishment; He cannot attain any other.

source: དུས་དང་ཚོད་དང་བཟླས་པ་དང་། །སྦྱིན་སྲེག་མཐོང་བས་དེ་བཞིན་འགྲུབ། །
en: The recitation synchronized with the homa Is again of three types. {27.85}

source: མཆོག་གིས་མཆོག་ནི་འགྲུབ་པ་དང་། །བར་མས་བར་མའི་གྲུབ་པ་སྣང་། །
en: “Superior accomplishment results from superior recitation, The middling is seen as the result of the middling,

source: ཐ་མས་ཐ་མའི་ལས་དག་ལ། །ཕྲན་ཚེགས་གྲུབ་པ་ཐོབ་པ་ཡིན། །
en: And the inferior accomplishment is obtained If the rite (karma) is minor and inferior.” {27.86}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། ཡི་གེ་གཅིག་པ་རྩ་བའི་རྒྱུད་འཕགས་པ་འཇམ་དཔལ་གྱི་སྙིང་པོའི་ཆོ་ག་རབ་འབྱམ་ལས། ལེའུ་ཉི་ཤུ་རྩ་གཅིག་པ་རྫོགས་སོ།། །།
en: This concludes the detailed chapter with instructions on the ritual procedures for the rites of the one-syllable root mantra—the heart essence of Noble Mañjuśrī—that include the painting, twenty-seventh in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་གཞན་ཡང་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now the blessed Śākyamuni looked again at the realm of the Pure Abode and said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་གཞན་ཡང་ཁྱོད་ཀྱི་རས་རིས་ཀྱི་ཆོ་ག་སྒྲུབ་པའི་ཐབས་ལ་ལས་ཐམས་ཅད་ཀྱི་དོན་སྒྲུབ་པ་ཉོན་ཅིག །
en: “There is, Mañjuśrī, in your ritual a painting procedure—a sādhana aid that accomplishes all activities.

source: འདི་ཉིད་ཀྱི་ཡི་གེ་གཅིག་པའི་སྙིང་པོའི་སྔགས་སམ་ཡི་གེ་དྲུག་པོ་མའི་མཐའ་ཅན་ཁྱོད་ཀྱི་སྔར་བསྟན་པའི་ཡི་གེ་དྲུག་པའི་སྙིང་པོའམ་དང་པོ་ན་ཨོྃ་ཡོད་པའི་ཡི་གེ་གཅིག་པའི་རས་རིས་དང་པོ་འདི་ཉིད་ཀྱི་ཆོ་གར་འགྱུར་བ་ནི་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན། དེ་བཞིན་གཤེགས་པ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་སྟོངས་ཤིང་རྩོད་པའི་དུས་ཐ་མར་ཕྱིན་པ་ན་འཇིག་རྟེན་སྐྱོབ་པ་མེད་པ་དང་སྐྱབས་མེད་པ་དང་གནས་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་ན།
en: The ritual performed in front of this painting should employ the aforementioned one-syllable heart mantra, or the six-syllable mantra that ends with ma , or your six-syllable root mantra that starts with oṁ , or the one-syllable mantra. This king of rites will become the means of protection in the future time, when I, the Tathāgata, am in parinirvāṇa and the buddhafield is empty—at the time when the lowest eon has arrived, and the world is without protection or refuge, and with nothing to resort to.

source: ཆོ་གའི་རྒྱལ་པོ་འདི་ཉིད་སྐྱོབ་པར་གྱུར་པ་དང་། སྐྱབས་སུ་གྱུར་པ་དང་། གནས་སུ་གྱུར་པ་དང་། དཔུང་གཉེན་དུ་གྱུར་པར་འགྱུར་རོ། །
en: This king of rites will then become the refuge, the succor, the place of rest, and the final resort.

source: དང་པོར་རེ་ཞིག་སྔ་མ་བཞིན་དུ་རས་མ་ཉམས་པ་སྐྲ་ཤད་དང་བྲལ་བ། ཞག་བདུན་ནམ་ཞག་བདུན་གསུམ་གྱི་བར་དུ་ཐག་པས་བཏགས་པ་ཁ་ཚར་དང་བཅས་པ། གུར་གུམ་དང་ཙནྡན་གྱི་ཆུས་བསང་གཏོར་བྱས་ཏེ
en: “To begin, one should draw Blessed Śākyamuni just as before, on an undamaged cloth that is shorn to remove loose fibers, seven cubits long and three cubits across, with a fringe, and infused with the essence of saffron and sandalwood.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་པདྨའི་གདན་ལ་བཞུགས་ཤིང་ཆོས་འཆད་པ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་གཟིགས་པ་བྲི་བར་བྱའོ། །
en: He is sitting on a lotus seat and expounding the Dharma, while looking at the divine youth Mañjuśrī.

source: གཡས་ཕྱོགས་སུ་ནོར་བཟང་དང་འཕགས་པ་བློ་གྲོས་མི་ཟད་པ་དང་འཇམ་དཔལ་ཡང་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་བར་བྱེད་པ།
en: On his right, one should draw Sudhana, Subhūmi, the noble Akṣayamati, and Mañjuśrī, all of them bowing to the Blessed One.

source: གཞོན་ནུའི་གཟུགས་ཅན་ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྲི་བར་བྱའོ། །
en: Each of them has the form of a divine youth with limbs adorned with all kinds of jewelry.

source: གཡོན་ཕྱོགས་སུ་ཀུན་ཏུ་བཟང་པོ་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་བཟང་སྐྱོང་དང་ལེགས་སྐྱེས་ཀྱང་བྲི་བར་བྱའོ། །
en: On his left, one should draw Samantabhadra, the noble Avalokiteśvara, Bhadrapāla, and Suśobhana. {28.2}

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལས་ཤིན་ཏུ་ཆུང་བར་འདྲིར་གཞུག་པར་བྱའོ། །
en: “They should all be painted smaller than the Blessed One.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་ནོར་བཟང་ནི་ལག་ན་རྔ་ཡབ་ཐོགས་པར་བྱའོ། །
en: Avalokiteśvara and Sudhana should be painted with yak-tail whisks in their hands.

source: འོག་ཏུ་ནི་སའི་ལྷ་མོ་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ལག་ན་ཐོགས་པ། རོ་སྟོད་ས་ལས་བྱུང་བ་འདྲིར་གཞུག་པར་བྱའོ། །
en: Below the Blessed One, Vasudhā should be drawn with a basketful of jewels in her hand and the upper half of her body emerging from the earth.

source: སྟེང་དུ་ནི་རིག་པ་འཛིན་པ་གཞོན་ནུ་གཉིས་ཕྲེང་བ་འཛིན་པ་སྤྲིན་གྱི་ནང་ནས་ཆར་གཏོང་བ་རིག་པ་དང་བཅས་པ་བྲི་བར་བྱའོ། །
en: Two vidyādhara youths adorned with garlands, and clouds releasing rain and lightning, should be painted above the Blessed One.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་ལག་ན་མེ་ཏོག་ཐོགས་པ། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ལ་རྣམ་པར་ལྟ་བ་དང་རྒྱན་དང་ལྡན་པ། དང་བའི་ལྟ་བ་དང་རོ་སྟོད་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་འདུད་པ་དང་བཅས་པ་འདྲིར་གཞུག་པར་བྱའོ། །
en: All the bodhisattvas hold flowers and jewels and look at the Blessed One’s face. They should be painted adorned with all types of jewelry, looking peaceful and happy, with the upper half of their bodies inclined in a sitting position. {28.3}

source: དེ་འདི་ལྟ་བུའི་རས་རིས་སྐུ་གདུང་དང་ལྡན་པའི་མཆོད་རྟེན་གྱི་དྲུང་དུ་ནུབ་ཏུ་བསྟན་ཏེ་བཞག་ལ་འཇམ་དཔལ་འདིའི་ཡི་གེ་གཅིག་པ་བཟླས་པ་འབུམ་བྱའོ། །
en: “One should place the painting near to a caitya containing relics and recite the syllable of Mañjuśrī one hundred thousand times while facing west.

source: ཤིང་བཞིན་དུ་མི་སྨྲ་བའི་དཀའ་ཐུབ་དང་དུས་གསུམ་དུ་ཁྲུས་བྱེད་པ་དང་གོས་ལན་གསུམ་བརྗེ་བ་དང་རྟག་ཏུ་གསོ་སྦྱོང་བྱེད་པ་དང་། ཚོད་རྔད་དང་ནས་ཆན་ཁྱོར་གང་ཙམ་དང་འོ་མ་དང་སློང་མོའི་ཟས་ཀྱིས་འཚོ་བའོ། །
en: One should carefully observe the vow of silence, bathe three times a day, use three pieces of clothing, and continually fast, eating dishes of vegetables and barley and whatever has been obtained as alms.

source: ཟས་ཀྱང་ཆ་རྣམ་པ་བཞིར་བྱ་སྟེ། ཆ་གཅིག་ནི་དཀོན་མཆོག་གསུམ་ལའོ། །གཉིས་པ་ནི་འཇམ་དཔལ་ལའོ། །གསུམ་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལའོ། །བཞི་པ་ནི་བདག་ཉིད་ཉེ་བར་སྤྱད་པར་བྱའོ། །
en: One should divide the food into four parts and offer one part to the Three Jewels, one part to Mañjuśrī, one part to all beings, and use one part oneself.

source: མི་དུབ་པའི་ལུས་ཀྱིས་བཅོམ་ལྡན་འདས་ཡིད་ལ་བྱ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པའི་ཡིད་དང་བདག་ཉིད་ཀྱི་དོན་ཅི་ཡང་མི་བྱེད་ཅིང་གཞན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་འདིར་བྱའོ་ཞེས་བསྒོམས་ནས་བཟླས་པ་བྱའོ། །
en: Not weakened in one’s body, one should visualize the Blessed One and, with the mind focused on all beings, recite the mantra while contemplating, ‘May I never do anything for my own sake, but always for the sake of all beings.’ {28.4}

source: ཁྲུས་དང་དྲི་དང་མེ་ཏོག་དང་སྤོས་དང་བཤོས་དང་མར་མེ་དག་ཀྱང་དབུལ་བར་བྱའོ། །
en: “One should offer water for bathing, fragrances, flowers, incense, a bali, and lamps,

source: ཁྲུས་ནི་རས་རིས་ཀྱི་གྲིབ་མའམ་གཟུགས་བརྙན་ལ་བྱའོ། །དྲི་ནི་འོག་ཏུ་གཏོར་བར་བྱའོ། །མེ་ཏོག་དང་བཤོས་ཀྱང་རྟག་ཏུ་དབུལ་ལོ། །
en: placing the water in the painting’s shadow, the fragrances below the painting, and the flower and bali articles all around.

source: དེ་ཉིད་དུ་འདི་དག་ལ་སྔར་མཆོད་པར་བྱ་སྟེ། དང་པོ་དཀོན་མཆོག་གསུམ་དང་། དེའི་འོག་ཏུ་བྱམས་པ་དང་། དེའི་འོག་ཏུ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། འཕགས་པ་ཀུན་ཏུ་བཟང་པོ་དང་། ནམ་མཁའི་སྙིང་པོ་དང་། འཕགས་པ་བློ་གྲོས་མི་ཟད་པ་དང་། ཟླ་འོད་གཞོན་ནུ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། འཕགས་པ་རྡོ་རྗེ་འཛིན་དང་། འཕགས་མ་སྒྲོལ་མ་དང་། འཕགས་མ་རྨ་བྱ་ཆེན་མོ་དང་། འཕགས་མ་གཞན་གྱིས་མི་ཐུབ་མ་དང་། བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ལ་དྲི་དང་།
en: One should first offer these things to the Three Jewels, then to Maitreya, and immediately after to Avalokiteśvara, Noble Samantabhadra, Noble Ākāśagarbha, Noble Akṣayamati, the divine youth Candraprabha, Sarva­nīvaraṇa­viṣkambhin, Noble Vajradhara, Noble Tārā, Noble Mahāmāyūrī, Noble Aparājitā, and Blessed Prajñāpāramitā.

source: མེ་ཏོག་དང་སྤོས་དང་གཏོར་མ་དང་མར་མེ་འདི་དག་ཐམས་ཅད་ལ་སྔར་མཆོད་ནས་ཕྱིས་རས་རིས་ལ་མཆོད་པར་བྱ་སྟེ
en: First one should offer all of the fragrances, flowers, incense, and the bali articles to those [just mentioned], and then to the painting. {28.5}

source: དེ་ནས་ཕྱི་རོལ་གྱི་ཕྱོགས་འགའ་ཞིག་ཏུ་སྦྲུལ་དང་རྔ་མོ་དང་བོང་བུ་དང་གླང་པོ་ཆེ་དང་ལོག་འདྲེན་གྱི་གཟུགས་གྲོག་མཁར་གྱིས་ལས་བྱས་ཏེ་དེ་དག་གི་ལྷག་མ་སྦྱིན་པར་བྱའོ། །
en: “Afterward, at some place outside, using clay from an anthill, one should make figurines of all the vināyakas in the form of camels, donkeys, dogs, and elephants, and offer everything to them.

source: སེམས་ཀྱིས་དྲན་པར་བྱ་བ་ནི་ཏིལ་གྱི་ཚིགས་མ་དང་གུ་གུལ་གྱི་ཚིགས་མ་དང་ཏིལ་ལས་བྱས་པའི་བཟའ་བ་དང་རྒྱ་སྲན་དང་ཉ་དང་ཤ་དང་སྐྱུ་རུ་ར་དང་བཅས་པ་དང་བ་ར་ཏ་ཀའི་བཟའ་བ་དང་པདྨའི་ལོ་མ་དང་ཁར་བའི་སྣོད་རྣམས་ཀྱང་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: One should remember to avoid oil-seed cakes, cakes made of pounded sesame seeds, horse gram ( kulattha ), fish, meat, root vegetables, and eggplant. Vessels made of lotus leaves or bell metal should also be avoided. {28.6}

source: ཀུ་ཤའི་ཁྲེས་ལ་འདུག་ཅིང་དེ་ཉིད་དུ་གནས་ནས། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱ་སྟེ་ཡིད་ཀྱིས་བཟླས་པ་བྱའོ། །
en: “One should practice the recollection of all the buddhas while sitting and resting on a bundle of kuśa grass. Mantra recitation should be performed mentally.

source: དབེན་པའི་གནས་གཞན་དུ་ཀུ་ཤ་སྟན་དུ་གདིང་བར་བྱའོ། །
en: One should prepare a bed in some other secluded place overspread with kuśa grass.

source: ཧ་ཅང་བཏུང་བ་མང་བ་དང་ཧ་ཅང་བཟའ་བ་མང་བ་དང་ཧ་ཅང་འགྲོ་བ་མང་བ་དང་ཧ་ཅང་ལྟ་བ་དང་ཧ་ཅང་ཉལ་བ་སྤང་བར་བྱའོ། །
en: One should avoid taking too much food or drink, or going out, seeing people, or sleeping too much.

source: དུས་གསུམ་དུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པར་བྱའོ། །
en: One should thus contemplate the buddhas three times a day

source: ས་བོན་བསྡམ་པར་ཡང་བྱའོ། །
en: and ensure the retention of semen.

source: རྨི་ལམ་བཟང་པོ་རྣམས་གཞན་ལ་རབ་ཏུ་བསྟན་པར་མི་བྱ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བརྗོད་པར་བྱའོ། །
en: One should not disclose one’s auspicious dreams to anyone but offer them instead to the Blessed One. {28.7}

source: དེ་བཞིན་དུ་མཐར་གྱིས་ཧ་ཅང་མི་མྱུར་བར་ཡི་གེ་གཅིག་པའི་བཟླས་པ་འབུམ་བྱའོ། །
en: “Proceeding on, one should speedily recite the One Syllable one hundred thousand times.

source: ཐ་མར་ཡང་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་བཀླག་པར་བྱའོ། །
en: At the end, one should read aloud [the text of] the blessed Prajñāpāramitā .

source: བཟླས་པའི་དུས་སུ་བཅོམ་ལྡན་འདས་སམ་ཡང་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཞལ་དུ་བལྟས་ལ། ཚིག་དང་ཡི་གེ་མ་འཁྲུགས་པས་བཟླས་བརྗོད་བྱ་ཞིང་
en: At the time of recitation one should look at the face of Blessed One or the divine youth Mañjuśrī and recite without mixing up the syllables or words.

source: བགྲང་ཕྲེང་ལ་ཕྱག་བྱས་ཏེ་དབུལ་བར་བྱའོ། །
en: [Each time] one reaches the end of the rosary, one should bow [to them] and offer [oneself to the deity].

source: ཆོ་ག་འདིས་སྔོན་དུ་བསྙེན་པ་བྱས་ཏེ། གང་དུ་ཡིད་དགེ་བ་ཡོད་པའི་གནས་དག་ཏུ་རས་རིས་དེ་གཞག་པར་བྱའོ། །
en: Having, in this manner, completed the preliminary practice, one should install the painting in some good place, where one will be able to do the [main] rite in a happy frame of mind.”

source: རས་རིས་ཀྱི་ཆོ་ག་དང་པོ་རྫོགས་སོ།། །།
en: This concludes the instructions on the painting procedure. {28.8}

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཇམ་དཔལ་ཙནྡན་དཀར་པོ་ལས་བྱས་པ་པདྨའི་གདན་ལ་བཞུགས་པ། བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ཕྱག་གཅིག་ན་འཛིན་པ། ཕྱག་གཡས་པ་ན་མ་དུ་ལུང་གའི་འབྲས་བུ་འཛིན་པ་བྱའོ། །
en: “Subsequently, one should fashion out of white sandalwood [an effigy of] Blessed Mañjuśrī sitting on a lotus seat, with the text of the blessed Prajñāpāramitā in his left hand and, in his right, a fruit.

source: དེ་གཙང་བའི་ཕྱོགས་གཅིག་ཏུ་ནུབ་ཕྱོགས་སུ་བསྟན་ལ་གཞག་པར་བྱས་ལ་དེའི་མདུན་དུ་མེ་ཐབ་བྱས་ཏེ།
en: One should install the effigy facing west in a secluded, clean place and dig a fire pit in front of it.

source: ལས་ཐམས་ཅད་ལ་ཟུར་བཞི་པ་མཐོ་དོ་ཙམ་གྱི་ཚད་དུ་བྱ་ཞིང་འོག་ཏུ་འབྲུ་ཐམས་ཅད་གཞུག་པར་བྱའོ། །
en: The pit should be, for all rites, square and two vitastis across. At the bottom, one should place the fragrances and all kinds of grain and make [the fire] above it.

source: དེ་ནས་དེའི་སྟེང་དུ་བྱ་བ་ནི་ཆོ་ག་འདིས་མེ་སར་པ་བསྐྱེད་དེ། ཤིང་ཨ་ཤྭཏྠའམ་མྱ་ངན་མེད་ཀྱི་ཡམ་ཤིང་དང་མར་དང་འབྲས་ཐུག་པོ་ཆེའི་ཆན་དང་འོ་མ་དང་ཞོ་དང་སྦྲང་རྩི་ཐམས་ཅད་བླངས་ཏེ།
en: Following this procedure, one should start a new fire, using sticks of the bodhi tree or aśoka tree. One should procure ghee, rice grains, boiled rice, milk, curds, and honey,

source: ཟངས་མའི་སྣོད་དུ་གཞག་པར་བྱས་ལ་སྟོང་རྩ་བརྒྱད་ཡོངས་སུ་བཟླས་ཤིང་བླུགས་གཟར་གྱིས་སྦྱིན་པར་བྱའོ། །
en: and place all of it together in a copper bowl. Having incanted it one thousand and eight times, one should perform the complete homa. {28.9}

source: ཕྱི་ནས་ཉིན་ཞག་གཞན་ལ་ཡར་ངོའི་ཚེས་ནས་བརྩམས་ཏེ་ལས་བྱའོ། །
en: “Later, on another day, starting during the bright fortnight, one should perform the following rite.

source: ཤིང་ཨ་ཤྭཏྠའི་ཡམ་ཤིང་གི་མེ་རབ་ཏུ་སྦར་ལ་དུ་བ་མེད་པར་མཐོང་ན་མེ་སྤྱན་དྲང་བར་བྱ་སྟེ།
en: One should make the fire using bodhi tree sticks and, seeing that the fire is without smoke, one should summon the god of fire:

source: ཨཱ་གཙྪ་ཧ་རི་པིངྒ་ལ། དཱིཔྟ་ཛི་ཧྭ་ལོ་ཧི་ཏཱཀྵ། དེ་ཧི་ད་དཱ་པ་ཡ་སྭཱ་ཧཱ།
en: “ Come! Come, O tawny-yellow one! One with a flaming tongue and red eyes! Give, give generously, O tawny-yellow one! Svāhā! {28.10}

source: སྔགས་འདིས་སྲེག་བླུགས་གསུམ་དབུལ་ལོ། །དེ་ནས་བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྤྱན་དྲང་བར་བྱ་སྟེ།
en: “With this mantra, one should offer three oblations, and then summon Blessed Mañjuśrī with the mantra:

source: ཨཱ་གཙྪ། ཨཱ་གཙྪ། ཀུ་མཱ་ར་བྷཱུ་ཏ་སརྦ་སཏྭཱརྠ་མུ་དྱ་ཏོ྅་ཧཾ། སཱ་ཧཱ་ཡྻེཀལྤ་ཡ། གནྡྷཾ་དྷཱུ་པཾ་ཙ་པྲ་ཏི་གྲྀཧྞ་སྭཱ་ཧཱ།
en: “ Come, come, O divine youth! Please help me as I strive for the welfare of all beings! Take these fragrances, flowers, and incense! Svāhā! {28.11}

source: གང་སྦྱིན་པར་བྱེད་པ་དེ་སྔགས་འདིས་སྦྱིན་པར་བྱའོ། །
en: “Whatever one offers, one should offer with this [mantra].

source: བྱོན་ན་མཆོད་ཡོན་དྲི་ཞིམ་པོའི་མེ་ཏོག་དང་ཆུ་དབུལ་བར་བྱ་སྟེ་དེ་ནས་སྦྱིན་སྲེག་བྱའོ། །
en: When the Blessed One arrives, one should present him with a welcome offering consisting of water with fragrant flowers and later perform a homa rite.

source: སྲེག་བླུགས་ལ་ལན་བདུན་བཟླས་ཏེ་ལན་ཅིག་གཏོར་རོ། །
en: One should offer only one oblation incanted seven times.

source: དེ་བཞིན་དུ་ཉི་མ་བདུན་གྱི་བར་དུ་མར་དང་འབྲས་ཐུག་པོ་ཆེའི་ཆན་གྱིས་ཚིམ་པར་བྱའོ། །
en: In this way, one should gratify him with ghee, rice, sesame, and barley for seven days.

source: སྐབས་འདིར་ངེས་པར་འཇམ་དཔལ་གཞོན་ནུའི་གཟུགས་མཐོང་བར་འགྱུར་རོ། །
en: At some point during this period one will certainly see Noble Mañjuśrī in the form of divine youth. {28.12}

source: ཙནྡན་གྱི་ཡམ་ཤིང་སོར་གཉིས་ཙམ་གྱི་ཚད་ཀྱིས་སྟོང་རྩ་བརྒྱད་བྱས་ན་རྒྱལ་པོ་དབང་དུ་འགྱུར་རོ། །
en: “One should offer one thousand and eight oblations of sticks of sandalwood, two fingers long. If one does this every day, one will enthrall one hundred princes. If one offers one hundred thousand flowers of royal jasmine, one will enthrall a king.

source: མེ་ཏོག་པདྨ་ལ་ཞོ་དང་སྦྲང་རྩི་དང་མར་གྱིས་བཏགས་ནས་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན་ནོར་རྙེད་པར་འགྱུར་རོ། །
en: If one offers one thousand lotuses smeared with curds, honey, and ghee, one will obtain power substances.

source: ཤིང་ཤྲི་ཤའི་མེའི་ཡམ་ཤིང་གིས་མེ་རབ་ཏུ་སྦར་ལ་ཏིལ་གྱི་སྦྱིན་སྲེག་བྱས་ན་ནོར་གྱི་བདག་པོར་འགྱུར་རོ། །
en: If one lights a fire of śamī sticks and offers into it sesame seeds, one will become an owner of great wealth.

source: རྟག་ཏུ་ཆུས་ཆུ་ལ་སྦྱིན་སྲེག་བྱས་ཏེ་ནང་པར་ལངས་ན་སྐྱེ་བོ་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །
en: If one always gets up early and offers oblations of water into water, one will become dear to all the people.

source: ཤིང་ཨརྐའི་ཡམ་ཤིང་དང་ཞོ་དང་སྦྲང་རྩི་དང་མར་གྱིས་བཏགས་ལ་སྦྱིན་སྲེག་འབུམ་བྱས་ན། གང་བསོད་སྙོམས་སྟོང་དང་ལྡན་པ་ཐོབ་བོ། །
en: If one offers one hundred thousand oblations of sticks of the crown flower plant smeared with curds, honey, and ghee, one will obtain a village [able to provide] one thousand alms rations.

source: ཤིང་བ་ཧུ་པུ་ཏྲི་ཀ་ཞེས་བྱ་བས་སྦྱིན་སྲེག་བྱས་ན་བུ་མོ་གང་འདོད་པ་དེ་རྙེད་དོ། །
en: If one offers oblations of fenugreek, one will obtain whatever virgin girl one desires.

source: ཤིང་ཨ་པ་མརྒས་སྦྱིན་སྲེག་བྱས་ན་ནད་རྣམས་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: If one offers [sticks of] devil’s horsewhip, one will pacify any pestilence. {28.13}

source: འོ་མ་ཅན་གྱི་ཤིང་གི་མེ་རབ་ཏུ་སྦར་ལ་ཏིལ་གྱི་སྦྱིན་སྲེག་བྱས་ན་གང་སེམས་པར་བྱེད་པ་དེ་ཐོབ་བོ། །ཡུལ་འདོད་པས་པདྨའི་སྦྱིན་སྲེག་འབུམ་བྱས་ན་ཡུལ་རྙེད་པར་འགྱུར་རོ། །
en: “If one lights a fire with sticks of a tree rich in sap and offers into it one hundred thousand oblations of sesame, one will obtain whichever girl one wishes for. If one desires sensual pleasures, one should offer one hundred thousand lotuses, and one will obtain them.

source: ནང་གི་སྦྱིན་སྲེག་འབུམ་བྱས་ན་ཟས་མི་ཟད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: By offering one hundred thousand oblations of barley, one’s food supply will become inexhaustible.

source: གུ་གུལ་དང་མེ་ཏོག་པྲི་ཡང་ཀུ་མར་དང་ལྷན་ཅིག་སྦྱིན་སྲེག་བྱའོ། །
en: If one offers oblations of bdellium and beautyberry together with ghee, one will obtain a son.

source: ཤིང་ཨརྐ་དང་སྣ་མའི་མེ་ཏོག་གིས་ཆུ་ལ་སྦྱིན་པ་བྱས་ན་ཞག་བདུན་གྱིས་གྲོང་ཐོབ་པར་འགྱུར་རོ། །
en: If one offers royal jasmine flowers into the water where the crown flower plant [grows on] the bank, one will obtain a village within seven days.

source: སྣ་མའི་མེ་ཏོག་གི་ཆུ་ལ་མེ་ཏོག་རེ་རེ་བླངས་ཏེ་སྦྱིན་པ་བྱས་པ་དང་ལྷག་མ་དཀྱིལ་འཁོར་ལ་བཞག་ན། གང་ལ་སྣོམ་དུ་བཅུག་པ་དེ་བསྣམས་པ་ཙམ་གྱིས་དབང་དུ་འགྱུར་རོ། །
en: If one offers into the water royal jasmine flowers one by one, one will enthrall any person to whom one gives the remaining fragments to smell—the enthrallment will happen through merely smelling them.

source: གུར་གུམ་དང་གླ་རྩི་དང་ལི་ཤིའི་མེ་ཏོག་ཁར་བཅུག་སྟེ། བཟླས་པ་བྱས་ན་གང་དང་ལྷན་ཅིག་གཏམ་བྱེད་པ་དེ་དབང་དུ་འགྱུར་རོ། །
en: If one recites the mantra, having put in one’s mouth some saffron, musk, and cloves, the person that one subsequently engages in conversation will become enthralled. {28.14}

source: ན་ལེ་ཤམ་ལ་སྟོང་རྩ་བརྒྱད་མངོན་པར་བསྔགས་པ་བྱས་ཏེ་ཁར་བཅུག་ན་ཁྲོས་པ་ཡང་ཚིག་གིས་དགའ་བར་འགྱུར་རོ། །
en: “If one puts in one’s mouth some black pepper [seeds], having incanted them one thousand and eight times, one’s words will be endearing even though one may be angry.

source: གཙུག་པུད་ལ་འདི་ཉིད་ཀྱི་སྔགས་ཀྱིས་བཅིངས་ན་མི་སྣང་བར་འགྱུར་རོ། །
en: If one ties these [seeds] into one’s topknot, one will become invisible.

source: ཡིད་ལ་རྗེས་སུ་དྲན་ན་དགྲས་མཐོང་ན་ཡང་ཁྲོ་བ་མེད་པར་འགྱུར་རོ། །
en: If one looks at an enemy and keeps them in mind, the [enemy’s] anger will depart. {28.15}

source: རྟག་ཏུ་བཟླས་པ་བྱས་ན་སྐྱེ་བོ་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །
en: “If one recites the mantra continually, one will be loved by all people.
